Бух_тест/src/InformationRegisters/УчетнаяПолитикаОрганизаций/УчетнаяПолитикаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаОрганизаций</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ВестиУчетДенежныхСредствПоОбособленнымПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВключатьСуммуДооценокОСВСоставНП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаПлательщикаЕдиногоНалога</name>
    <type>
      <types>EnumRef.ГруппыПлательщиковЕдиногоНалога</types>
    </type>
  </resources>
  <resources>
    <name>ИнформацияОСтатусеПлательщикаНалогов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользуемыеКлассыСчетовРасходов</name>
    <type>
      <types>EnumRef.КлассыСчетовРасходов</types>
    </type>
  </resources>
  <resources>
    <name>НалогНаПрибыльБезКорректировокФинансовогоРезультата</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НалогНаПрибыльКонсолидированно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НалоговоеНазначениеНераспределенныхПостоянныхОПЗ</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </resources>
  <resources>
    <name>НеРаспределятьОПЗнаСебестоимостьПродукции</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикЕдиногоНалога</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНалогаНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокРаспределенияРасходовНаОказаниеВнутреннихУслуг</name>
    <type>
      <types>EnumRef.ПорядокРаспределенияРасходовНаОказаниеВнутреннихУслуг</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокРаспределенияРасходовНаОказаниеУслуг</name>
    <type>
      <types>EnumRef.ПорядокРаспределенияРасходовНаОказаниеУслуг</types>
    </type>
  </resources>
  <resources>
    <name>СпособОценкиМПЗ</name>
    <type>
      <types>EnumRef.СпособыОценки</types>
    </type>
  </resources>
  <resources>
    <name>СпособОценкиТоваровВРознице</name>
    <type>
      <types>EnumRef.СпособыОценкиТоваровВРознице</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаСебестоимостиПроизводства</name>
    <type>
      <types>EnumRef.СпособыРасчетаСебестоимостиПродукции</types>
    </type>
  </resources>
  <resources>
    <name>СхемаНалогообложения</name>
    <type>
      <types>CatalogRef.СхемыНалогообложения</types>
    </type>
  </resources>
  <resources>
    <name>УвеличиватьСтоимостьОСНаСуммуУлучшенияВПорядкеНКУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВестиДневнуюНумерациюНалоговыхДокументов</name>
    <comment>Возможность вести нумерацию Налоговых накладных и Приложений 2 с № 1 каждый день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВестиМесячнуюНумерациюНалоговыхДокументов</name>
    <comment>Возможность вести нумерацию Налоговых накладных и Приложений 2 с № 1 каждый месяц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВестиНумерациюНалоговыхДокументовБезУчетаОбособленныхПодразделений</name>
    <comment>Возможность вести нумерацию налоговых документов без учета обособленных подразделений, в случае, когда обособленные подразделения указаны в документах</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВестиРаздельнуюНумерациюНалоговыхДокументов</name>
    <comment>Разные нумераторы для Налоговой накладной и Приложения 2 к налоговой накладной</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВестиРаздельнуюНумерациюНалоговыхДокументовПоНеНДСОперациям</name>
    <comment>Технологические налоговые документы &quot;Не НДС&quot; не будут занимать номера обычных налоговых</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВестиРаздельнуюНумерациюНалоговыхДокументовПоСпецРежимам</name>
    <comment>Разные нумераторы для Налоговой накладной и Приложения 2 к налоговой накладной для разных спец. режимов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВестиРаздельнуюНумерациюНалоговыхНакладныхПоОбычнымЦенам</name>
    <comment>Будут ли налоговые накладные по ОЦ занимать номер налогой накладной или будут иметь тот же номер, что и основаная налоговая (но тип причины невыдачи = 01)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВыводитьНомерДоговораБезКлеточек</name>
    <comment>Чем заполнять пустые показатели (с 2011 г.): Знаком &quot;X&quot;, &quot;-&quot;, или пустой строкой, например</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьНеДополнятьНаименованиеНомеромГТДВНалоговыхДокументах</name>
    <comment>только для формы по приказу 1379</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьПечататьДатыВНалоговыхНакладныхСРазделителями</name>
    <comment>только для формы по приказу 1379</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьПечататьКодУКТВЭДБезПробелов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьПечататьТитульныйЛистДляПриложения2КНалоговойНакладной</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСимволПустыхПоказателейВНалоговойНакладной</name>
    <comment>Чем заполнять пустые показатели (с 2011 г.): Знаком &quot;X&quot;, &quot;-&quot;, или пустой строкой, например</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьВыгрузкаПечатьНН_ПоФормеНаДатуДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бух_тест/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

Бух_тест/src/Enums/КлассыСчетовРасходов/КлассыСчетовРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КлассыСчетовРасходов</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Класс8</name>
  </enumValues>
  <enumValues>
    <name>Класс9</name>
  </enumValues>
  <enumValues>
    <name>Класс8и9</name>
  </enumValues>
</mdclass:Enum>

Бух_тест/src/Enums/ГруппыПлательщиковЕдиногоНалога/ГруппыПлательщиковЕдиногоНалога.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГруппыПлательщиковЕдиногоНалога</name>
  <comment>Группы плательщиков единого налога</comment>
  <enumValues>
    <name>ПерваяГруппа</name>
  </enumValues>
  <enumValues>
    <name>ВтораяГруппа</name>
  </enumValues>
  <enumValues>
    <name>ТретьяГруппа</name>
  </enumValues>
  <enumValues>
    <name>ЧетвертаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>ПятаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>ШестаяГруппа</name>
  </enumValues>
</mdclass:Enum>

Бух_тест/src/Enums/СпособыОценки/СпособыОценки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОценки</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>ПоСредней</name>
  </enumValues>
  <enumValues>
    <name>ФИФО</name>
    <comment>First input, first output (первым пришел, первым обработан)</comment>
  </enumValues>
  <enumValues>
    <name>ЛИФО</name>
    <comment>Last input, first output (последним пришел, первым обработан)</comment>
  </enumValues>
</mdclass:Enum>

Бух_тест/src/Enums/СпособыОценкиТоваровВРознице/СпособыОценкиТоваровВРознице.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОценкиТоваровВРознице</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПоСтоимостиПриобретения</name>
  </enumValues>
  <enumValues>
    <name>ПоПродажнойСтоимости</name>
  </enumValues>
</mdclass:Enum>

Бух_тест/src/Enums/ПорядокРаспределенияРасходовНаОказаниеВнутреннихУслуг/ПорядокРаспределенияРасходовНаОказаниеВнутреннихУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядокРаспределенияРасходовНаОказаниеВнутреннихУслуг</name>
  <enumValues>
    <name>ПоПлановымЦенам</name>
  </enumValues>
  <enumValues>
    <name>ПоОбъемуВыпуска</name>
  </enumValues>
  <enumValues>
    <name>ПоПлановымЦенамИОбъемуВыпуска</name>
  </enumValues>
</mdclass:Enum>

Бух_тест/src/Enums/ПорядокРаспределенияРасходовНаОказаниеУслуг/ПорядокРаспределенияРасходовНаОказаниеУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядокРаспределенияРасходовНаОказаниеУслуг</name>
  <enumValues>
    <name>ПоПлановымЦенам</name>
  </enumValues>
  <enumValues>
    <name>ПоВыручке</name>
  </enumValues>
  <enumValues>
    <name>ПоПлановымЦенамИВыручке</name>
  </enumValues>
</mdclass:Enum>

Бух_тест/src/Enums/СпособыРасчетаСебестоимостиПродукции/СпособыРасчетаСебестоимостиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРасчетаСебестоимостиПродукции</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПоПеределам</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоПодразделениям</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

Бух_тест/src/Catalogs/СхемыНалогообложения/СхемыНалогообложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СхемыНалогообложения</name>
  <predefined>
    <items>
      <name>ЕдиныйНалог</name>
      <description>Единый налог</description>
    </items>
    <items>
      <name>ЕдиныйНалогИНДС</name>
      <description>Единый налог и НДС</description>
    </items>
    <items>
      <name>НалогНаПрибыль</name>
      <description>Налог на прибыль</description>
    </items>
    <items>
      <name>НалогНаПрибыльИНДС</name>
      <description>Налог на прибыль и НДС</description>
    </items>
    <items>
      <name>НеПлательщик</name>
      <description>Неплательщик</description>
    </items>
  </predefined>
  <attributes>
    <name>НалогНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиныйНалог</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Бух_тест/src/InformationRegisters/УчетнаяПолитикаОрганизаций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, ИмяРеквизита, ЗначениеПоУмолчанию)

	Если НЕ ДанныеЗаполнения.Свойство(ИмяРеквизита, ЗаписьРегистра[ИмяРеквизита]) Тогда
		ЗаписьРегистра[ИмяРеквизита] = ЗначениеПоУмолчанию;
	КонецЕсли;

КонецПроцедуры

Процедура УстановкаПараметровУчетнойПолитикиПоУмолчанию(ЗаписьРегистра, ДанныеЗаполнения) Экспорт

	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "Организация", БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация"));
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "Период", НачалоГода(ТекущаяДатаСеанса()));
	
	ЭтоФизЛицо	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаписьРегистра.Организация, "ЮридическоеФизическоеЛицо")
		= Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	
	// Общие сведения
	СхемаНалогообложенияПоУмолчанию = ПолучитьСхемуНалогообложенияПоУмолчанию(ЭтоФизЛицо);
	
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "СхемаНалогообложения", СхемаНалогообложенияПоУмолчанию);
	
	РеквизитыСхемаНалогообложения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		СхемаНалогообложенияПоУмолчанию, "НалогНаПрибыль,НДС,ЕдиныйНалог");
		
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ПлательщикНалогаНаПрибыль", РеквизитыСхемаНалогообложения.НалогНаПрибыль);
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ПлательщикНДС", РеквизитыСхемаНалогообложения.НДС);
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ПлательщикЕдиногоНалога", РеквизитыСхемаНалогообложения.ЕдиныйНалог);
	
	
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ИспользуемыеКлассыСчетовРасходов", Перечисления.КлассыСчетовРасходов.Класс8и9);
	
	// Налог на прибыль

	// НДС
	
	// Единый налог
	Если РеквизитыСхемаНалогообложения.ЕдиныйНалог Тогда
		УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ГруппаПлательщикаЕдиногоНалога", Перечисления.ГруппыПлательщиковЕдиногоНалога.ПерваяГруппа);
	КонецЕсли;
	
	
	// Запасы
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "СпособОценкиМПЗ", 
		Перечисления.СпособыОценки.ПоСредней);
		
	// Розница
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "СпособОценкиТоваровВРознице", 
		Перечисления.СпособыОценкиТоваровВРознице.ПоСтоимостиПриобретения);

	// Производство
	УстановитьЗначениеРеквизита(
		ЗаписьРегистра, 
		ДанныеЗаполнения, 
		"ПорядокРаспределенияРасходовНаОказаниеВнутреннихУслуг",
		Перечисления.ПорядокРаспределенияРасходовНаОказаниеВнутреннихУслуг.ПоПлановымЦенам);
		
	УстановитьЗначениеРеквизита(
		ЗаписьРегистра, 
		ДанныеЗаполнения, 
		"ПорядокРаспределенияРасходовНаОказаниеУслуг",
		Перечисления.ПорядокРаспределенияРасходовНаОказаниеУслуг.ПоПлановымЦенам);

	// Производство: Выпуск продукции, услуг
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "СпособРасчетаСебестоимостиПроизводства", 
		Перечисления.СпособыРасчетаСебестоимостиПродукции.ПоПеределам);
		
	
КонецПроцедуры

Процедура УстановкаПараметровУчетнойПолитикиПоУмолчаниюНаПериод(ЗаписьРегистра) Экспорт


КонецПроцедуры


Функция ПолучитьСхемуНалогообложенияПоУмолчанию(ЭтоФизЛицо = Ложь) Экспорт
	
	Если ЭтоФизЛицо Тогда
		СхемаНалогообложенияПоУмолчанию	= Справочники.СхемыНалогообложения.ЕдиныйНалогИНДС;
	Иначе
		СхемаНалогообложенияПоУмолчанию	= Справочники.СхемыНалогообложения.НалогНаПрибыльИНДС;
	КонецЕсли;
	
	Возврат СхемаНалогообложенияПоУмолчанию;
	
КонецФункции

#КонецЕсли
